app/controllers/expenses_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @expense = Expense.new
    @users = User.all

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", "16"]]
SELECT "users".* FROM "users"
---
  def edit
    @expense = Expense.find(params[:id])
    @users = User.all

SELECT "expenses".* FROM "expenses"
---
  def sum
    expenses = Expense.all