app/controllers/expense_histories_controller.rb

  def index
    @expense_histories = ExpenseHistory.order("id DESC").page(params[:page])
---
SELECT "expense_histories".* FROM "expense_histories" ORDER BY id DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "expense_histories"